{
    "subject": "Authorization Exceptions Matrix",
    "product": {
        "marketplace": false,
        "medicaid": true,
        "medicare": false,
        "mmp_mmcp": false
    },
    "state": {
        "all": false,
        "az": false,
        "ca": false,
        "fl": false,
        "id": false,
        "il": false,
        "ia": false,
        "ky": false,
        "ma": false,
        "mi": false,
        "ms": false,
        "ne": false,
        "nv": false,
        "nm": false,
        "ny": false,
        "oh": true,
        "pr": false,
        "sc": false,
        "tx": false,
        "ut": false,
        "va": false,
        "wa": false,
        "wi": false
    },
    "lines_of_business": "All",
    "document_owner": "Nancy Vasquez",
    "created_by": "Unknown",
    "created_date": "08/19/21",
    "revised_by": "Lynne Edwards",
    "approved_date": "06/17/24",
    "approved_by": "Emmanuel Medrano",
    "approved_via": "MDR Power Automate",
    "approver_title": "MHI - Director, Claims",
    "iqr_reviewer": null,
    "iqr_date": null,
    "overview": {
        "quick_summary": "This reference provides information regarding services that are exceptions to the authorization requirements."
    },
    "contents": [
        "Overview",
        "Quick Summary",
        "Contents",
        "Authorization Exceptions Matrix",
        "Service Exceptions",
        "Provider Authorization Exceptions",
        "SOP Authorization Exceptions",
        "Revision Summary"
    ],
    "AuthorizationExceptionsMatrix": {
        "ServiceExceptions": [
            {
                "Service": "General Exceptions",
                "ExceptionInformation": [
                    "Authorization is not required for outpatient services billed in conjunction with an ER visit or Observation during the same patient encounter. The lead claim (hospital claim) will be submitted with revenue code 045X for ER or revenue code 720 or 721, 76X for observation.",
                    "All services rendered during the member’s Transition of Care (T.O.C.) period do not require authorization.",
                    "Authorization is not required for outpatient hospital (UB) claims if surgical services that normally do not require PA in an office setting are billed in conjunction with revenue code 51X (clinic) on the same DOS."
                ]
            },
            {
                "Service": "Emergency/Urgent Care Services",
                "ExceptionInformation": {
                    "Emergency": [
                        "Authorization is not required for outpatient services billed in conjunction with an ER visit during the same patient encounter.",
                        "The lead claim (hospital claim) will be submitted with revenue code 450 for ER.",
                        "Professional claims billed with place of service 23 (ER) do not require PA."
                    ],
                    "UrgentCare": [
                        "Authorization is not required for services billed in conjunction with an Urgent Care visit.",
                        "Identified by revenue code 516 on an outpatient claim or place of service.",
                        "20 (Urgent Care)",
                        "22 (Outpatient)",
                        "11 (Office Visit)"
                    ]
                }
            },
            {
                "Service": "Inpatient Physician Services – POS 21",
                "ExceptionInformation": [
                    "All services billed with POS 21 do not require authorization for PAR/non-PAR providers if services were rendered at a PAR facility (regardless of authorization status of facility services). Follow these guidelines:",
                    "1. Review the claim history for a lead bill or Box 32 on the claim image to determine if the facility is PAR.",
                    "2. Link the authorization (if present) to prevent the claim from denying.",
                    "If services were rendered at a non-PAR facility authorization is required.",
                    "Newborn E&M codes do not require authorization for PAR/non-PAR providers, even if the services were rendered at a non-PAR facility.",
                    "All physician E&M, radiology, and lab services provided in a SNF setting (Place of Service 31) should be paid regardless of authorization status. Refer to OAC 5160-3-19."
                ]
            },
            {
                "Service": "Newborn Inpatient Admissions",
                "ExceptionInformation": [
                    "Newborn stays are authorized under the mother’s auth for both PAR and non-PAR providers if the baby and mother are discharged at the same time. Review the mother’s record for authorization.",
                    "Newborn stays require a separate authorization if the mother is discharged before the baby (Boarder Baby).",
                    "Newborn claims tied to denied authorizations should be allowed for payment and not denied.",
                    "Vaginal delivery stays of up to 3 days at a gestation period of 39 weeks or greater do not require prior authorization.",
                    "Cesarean Section (C-Section) delivery stays of up to 5 days at a gestation period of 39 weeks or greater do not require prior authorization."
                ]
            }
        ]
    },
    "Non-Emergent Air Ambulance": {
        "Prior authorization required": true,
        "Details": [
            "To determine if emergent, check the ER column on the 'Service' tab in the core claims processing system for a 'Y' or 'N.'",
            "Only deny for authorization if there is an 'N' in that box.",
            "All other ambulance services (emergent and non-emergent) do not require authorization for par or non-par providers."
        ]
    },
    "Non-PAR Providers": {
        "Authorization not required for": [
            "Outpatient services billed in conjunction with an ER visit or Observation during the same patient encounter.",
            {
                "Lead claim": "The lead claim (hospital claim) will be submitted with revenue code 045X for ER or revenue code 720 or 721, 76X for observation."
            },
            "All services rendered during the member’s Transition of Care (TOC) period.",
            "Emergency Department /Urgent Care Services",
            "Child and Adolescent Health Center Services",
            "Local Health Department (LHD) Services",
            "All non-par providers of Dialysis Services including non-PAR hospitals",
            "QFPP Facilities"
        ]
    },
    "Obstetric Services": {
        "Authorization not required for": "OB Observation facility claims do not require authorization for any services when billed with revenue code 720 or 721 or 76X for PAR/non-PAR."
    },
    "Outpatient Physician Services – POS 22": {
        "Authorization not required for": [
            "All anesthesiology, laboratory/pathology, and diagnostic radiology services billed with POS 22 do not require authorization for PAR/non-PAR providers if:",
            {
                "Conditions": [
                    "Services were rendered at a PAR facility",
                    "Review claim history for a lead bill or Box 32 on claim image to determine if the facility is PAR."
                ]
            }
        ],
        "Note": "Non-PAR providers require authorization for E&M codes and surgical codes submitted with POS 22, unless the lead claim (hospital claim) is submitted with revenue code 45X for an ER visit or revenue codes 720, 721, 760, or 762 for observation. The system is configured to fire an edit for codes requiring authorization."
    },
    "Pain Management Procedures (CPT range 60000-69999)": {
        "Authorization not required for": "An authorization is not required when billed by a PAR/non-PAR anesthesiologist on the same day as the surgery."
    },
    "RAP Providers": {
        "Modifier 26": "Modifier 26 for all places of service does not require authorization for PAR or non-PAR.",
        "Reference": "Refer to the 'RAP Providers, No PA for Non PAR - All States Medicaid - Processing Guideline.'"
    },
    "Skilled Nursing Facility (SNF) Admissions": {
        "Bed hold days": "Bed hold days (revenue codes 018X) must be listed separately in the authorization.",
        "Details": "If the revenue code is listed in the line item approved services on the authorization but the claim is billed with more units than approved, pay the claim as long as it is within the date span authorized and does not exceed 30 bed hold days per year."
    },
    "Sleep Studies": {
        "Authorization not required for": "Sleep Study codes billed with modifier 26."
    },
    "Surgical Services": {
        "Post-op Pain Management (CPT range 60000-69999)": {
            "Authorization not required for": "Authorization is not required when billed by a PAR/non-PAR anesthesiologist on the same day as the surgery.",
            "Details": [
                "Outpatient surgical services are authorized for one"
            ]
        }
    },
    "ProviderAuthorizationExceptions": {
        "Provider": "Nationwide Children's Hospital (Tax ID#314379441)",
        "Exceptions": [
            "An authorization is not required under the capped arrangement (contract: HOSP - PFK - NATIONWIDE CHILDRENS HOSPITAL CAP/105% - 180FT) for members 0-18 with one of the following rate codes: AFB1AAFKNR25, AFB1AAFKNR, AFB2AAFKNR, DB1CDNR, DB1CDNR25, DB2CDNR, FB10ANR, FB10ANR25, FB10BNR, FB10BNR25, FB10CNR, FB10CNR25, FB10D, FB10ENR, FB10ENR25, FB10FNR, FB10FNR25, FB20ANR, FB20BNR, FB20CNR, FB20ENR, FB20FNR",
            "Capitated member's claims should not be denied for a PA.",
            "Par and Non-Par Professional FFS or Capitated claims for services performed at Nationwide Children's Hospital should not be denied for PA if the member has one of the above rate codes.",
            "If the claim meets the above criteria and a PA edit fires, override the PA edit and process the claim accordingly."
        ]
    },
    "SOPAuthorizationExceptions": {
        "SOP": [
            {
                "Name": "Date span billed is prior to date span authorized (72-hour rule)",
                "Exceptions": [
                    "If the from date on the claim is prior to the admission date on the claim in box 12, and the admission date in box 12 is equal to the from date on the authorization, all charges prior to the admit date are included in the authorization and are payable.",
                    "If a claim hits an outlier these charges would be included in the outlier calculation."
                ]
            },
            {
                "Name": "Number of inpatient days billed exceeds number of days authorized",
                "Exceptions": [
                    "If the claim hits an outlier and days are not authorized an itemized statement is required.",
                    "If the facility is a DRG-exempt facility (pays % of billed charges) and days are not authorized an itemized statement is required."
                ]
            }
        ]
    },
    "RevisionSummary": {
        "RequestID": "RITM4535490",
        "PostedArchivedDate": "06/24/24",
        "ARYN": "N",
        "Comments": [
            "Added bullets 4-6 in the 'Newborn Inpatient Admissions' section.",
            "Updated the link referenced in the RAP section.",
            "Updated the document to a template so that revisions can be documented appropriately going forward."
        ]
    }
}