{
    "Processing COB Edits When External Enrollment is secondary, and No EOB is Submitted": [
        "Confirm the COB segment and external enrollment status.",
        "Check state-specific guidelines to see if the service is exempt from EOB requirements.",
        "If no EOB is attached and the service is not exempt, deny the claim and request an EOB with the appropriate remit code."
    ],
    "Processing COB Claims with COB Payer is Medicare (COBA Claims)": {
        "Medicare Services Covered": "Part A: Inpatient hospital care, hospice, skilled nursing, and home health services. Part B: Outpatient services, diagnostics, therapies, and preventive care.",
        "Rules for Processing Medicare Claims": "If a member has only Medicare Part B, Molina becomes the primary payer for inpatient claims. If Medicare exhausts benefits or denies a claim, Molina acts as secondary."
    },
    "Processing Claims when External Enrollment is Secondary and EOB is Submitted and Edit Number is Present": [
        "If Molina is Paying the difference - No Authorization is required",
        "If primary payer denied the claim - Deny the claim for lack of authorization and route it to UMT for review",
        "If the primary payer did not provide an EOB - Confirm the COB segment and external enrollment status. Refer to the `Authorization Business Process - All States and LOBs - SOP` to Verify if an authorization is required."
    ],
    "Processing Claims when External Enrollment is Secondary and EOB is Submitted and Edit Number is not Present": {
        "COB_Payment_Calculation_Methods_Calculations": [
            "1. Adjudicate the claim on the Pay tab in the Claims module to determine Molina’s regular allowable, manually pricing, as necessary. Based on system configuration, the core claims processing system will calculate the appropriate final reimbursement amount(s).",
            "2. Review how the COB payment information is applied on the claim (Method 2, 3, 9 or 10). Click on the Edits tab and scroll past the Calculate Contract Amounts to the section entitled COB Calculations.",
            "Method-2: Pay the difference between Molina’s allowable amount and the primary payer’s payment.",
            "Method-3: Pay the lesser of Molina’s allowable or the secondary calculation.",
            "Method-9: If the secondary calculation equals $0, process the claim as primary.",
            "Method-10: Pay the lesser of patient responsibility or Molina allowable minus the primary payment."
        ]
    },
    "Processing Claims When External Enrollment is primary and EOB is Submitted": {
        "Steps to Follow": [
            "Pend the claim and route it to the Eligibility Department (OIV queue).",
            "Add a comment: 'Requires COB segment, EOB attached.'",
            "Once the eligibility is updated, process the claim according to state-specific COB rules."
        ]
    },
    "Processing Claims When External Enrollment is primary and No EOB is Submitted": {
        "Steps to Follow": [
            "COB does not apply",
            "Process claim as primary."
        ]
    },
    "Third-Party Liability (TPL) Scenarios": {
        "1. Examples of TPL Scenarios:": "Auto insurance claims. Slip-and-fall injuries covered by homeowner insurance. Workers' Compensation cases. Product liability claims (e.g., injuries from defective products).",
        "2. TPL Process": "Pay and pursue: Pay the claim first and pursue recovery from the liable party later."
    },
    "Processing Electronic Claims with COB Information": {
        "Using_EDI_Claim_Viewer": "Review electronic claims for primary insurance payment information.",
        "If_Primary_Information_is_Incomplete": "Deny the claim and request the missing EOB from the provider."
    },
    "Consent Form Requirements for Sterilization Procedures": [
        "1. If the primary payer covered the service: Deny the claim if a consent form is missing.",
        "2. If the primary payer denied the service: Deny the claim and request a consent form."
    ],
    "Special MIHP Rules (Michigan Exception)": {
        "Certain services under Michigan’s Maternal Infant Health Program (MIHP) are exempt from EOB requirements.": [
            {
                "Code": "96167",
                "Description": "Health Behavior Intervention",
                "Max_Fee": "$95.80",
                "Comments": "1 per visit"
            },
            {
                "Code": "A0100",
                "Description": "Non-emergency Transport (Taxi)",
                "Max_Fee": "$23.44"
            },
            {
                "Code": "S9442",
                "Description": "Birthing Class",
                "Max_Fee": "$34.84"
            }
        ]
    },
    "Summary of Key Actions and Rules": [
        "1. Check for primary insurance information before processing claims.",
        "2. Apply state-specific guidelines for COB exceptions and authorizations.",
        "3. Pend claims missing external enrollment segments and route them to the Eligibility Department.",
        "4. Coordinate Medicare claims carefully to avoid duplicate payments.",
        "5. Use appropriate remit codes for every denial scenario."
    ],
    "References": [
        "Authorization Business Process SOP – All States",
        "Reading and Interpreting EOBs SOP",
        "Workflow Routing Instructions – All States Medicaid",
        "Timely Filing Requirements by State Job Aid"
    ]
}