{
    "Subject": "Single Case Agreement (SCA)/Letters of Agreement (LOA)",
    "Product": {
        "Marketplace": false,
        "Medicaid": true,
        "Medicare": false,
        "MMP/MMCP": false
    },
    "State": {
        "ALL": false,
        "AZ": true,
        "CA": true,
        "FL": false,
        "ID": false,
        "IL": false,
        "KY": false,
        "MA": false,
        "MI": false,
        "MS": false,
        "NM": false,
        "NV": false,
        "NY": false,
        "OH": false,
        "PR": false,
        "SC": false,
        "TX": false,
        "UT": false,
        "VA": false,
        "WA": false,
        "WI": false
    },
    "Line(s) of Business": "All",
    "Document Owner": "Yvette Smart",
    "Created By": "Don Larson",
    "Created Date": "02/14/23",
    "Revised By": null,
    "Approved Date": "03/01/23",
    "Approved By": "Yvette Smart",
    "Approved Via": "Document Intake Site",
    "Approver Title": "MHI – Dir., Claims",
    "QDC": {
        "Reviewed": false,
        "Missed Review": false,
        "N/A": true
    },
    "Overview": {
        "Definitions": {
            "Terms": [
                {
                    "Term": "Letter of Agreement (LOA)",
                    "Definition": "A special agreement signed by a Molina representative as well as a representative of the provider of health care service, entered into on a per-case basis, outlining terms and agreements relative to reimbursement on a particular claim. It is sometimes also known as a Memo of Understanding (MOU) or a Letter of Understanding."
                },
                {
                    "Term": "Single Case Agreement (SCA)",
                    "Definition": "A negotiated contract between Molina and a provider (typically an out-of-network provider) to provide reimbursement for services rendered to a member, treated on a case-by-case scenario."
                }
            ]
        },
        "Exhibits": {
            "Exhibit I": "Molina AZ SCA"
        }
    },
    "Contents": {
        "Overview": {
            "Purpose": 1,
            "Expected Outcome": 1,
            "Contents": 2,
            "Definitions": 3,
            "Exhibits": 3
        },
        "Processing Instructions": {
            "SCAs and LOAs": 4,
            "Edit 203": 4,
            "Manually Pricing SCA/LOA Claims": 5
        },
        "Revision Summary": 5,
        "Exhibit I: Molina AZ SCA": 6
    },
    "title": "Request for Taxpayer Identification Number and Certification",
    "sections": [
        {
            "title": "1. Name (as shown on your income tax return)",
            "value": null
        },
        {
            "title": "2. Business name/disregarded entity name, if different from above",
            "value": null
        },
        {
            "title": "3. Check appropriate box for federal tax classification of the person whose name is entered on line 1. Check only one of the following seven boxes.",
            "options": [
                "Individual/sole proprietor or single-member LLC",
                "C Corporation",
                "S Corporation",
                "Partnership",
                "Trust/estate",
                "Limited liability company. Enter the tax classification (C=C corporation, S=S corporation, P=Partnership) ->",
                "Other (see instructions)"
            ],
            "selected_option": null
        },
        {
            "title": "4. Exemptions (codes apply only to certain entities, not individuals; see instructions on page 3):",
            "subsections": [
                {
                    "title": "Exempt payee code (if any)",
                    "value": null
                },
                {
                    "title": "Exemption from FATCA reporting code (if any)",
                    "value": null
                }
            ]
        },
        {
            "title": "5. Address (number, street, and apt. or suite no.)",
            "value": null
        },
        {
            "title": "6. City, state, and ZIP code",
            "value": null
        },
        {
            "title": "7. List account number(s) here (optional)",
            "value": null
        }
    ],
    "page": 4,
    "total_pages": 9,
    "ProcessingInstructions": {
        "Section": "Continued",
        "Title": "Manually Pricing SCA/LOA Claims",
        "Instructions": "Follow the steps below to manually price claims with an SCA/LOA:",
        "Steps": [
            {
                "StepNumber": 1,
                "Action": "Review the NON CLINICAL NOTE section.",
                "Note": "The SCA or LOA may be attached to the claim form or entered as a note on the authorization."
            },
            {
                "StepNumber": 2,
                "Action": "Click Pay in the core claims processing system.",
                "ImageDescription": "Screenshot showing the 'Pay' option highlighted."
            },
            {
                "StepNumber": 3,
                "Action": "Click Manual Contract Price Override.",
                "ImageDescription": "Screenshot showing the 'Manual Contract Price Override' button."
            },
            {
                "StepNumber": 4,
                "Action": "Enter the payment amount found on the SCA/LOA:",
                "SubActions": [
                    "Type the amount in the Manual Contract Amount field.",
                    "Tab to the end of the line.",
                    "Click Save."
                ],
                "ImageDescription": "Screenshot showing the 'Manual Contract Amount' field and 'Save' button."
            },
            {
                "StepNumber": 5,
                "Action": "Adjudicate and finalize the claim. (End)"
            }
        ]
    },
    "RevisionSummary": {
        "RequestID": 5569,
        "PostedArchivedDate": "03/01/23",
        "QDC": "Y",
        "Comments": "New document."
    },
    "date": "12/1/2022",
    "member_information": {
        "member_name": null,
        "medicaid_id": null,
        "member_dob": null
    },
    "provider_information": {
        "name": null,
        "gender": "Male",
        "dob": "N/A",
        "individual_npi": null,
        "medicaid_id": null,
        "facility_mcd_number": null,
        "upin_medicare_number": null,
        "license_number": null,
        "license_type": "OH MD",
        "specialty": "Internal Medicine",
        "taxonomy": null
    },
    "service_address": {
        "address": null,
        "phone": null,
        "city_state_zip_code": null,
        "county": null
    },
    "billing_information": {
        "tin": null,
        "group_name": null,
        "billing_npi": null,
        "billing_medicaid_id": null,
        "billing_address": null,
        "city_state_zip": null
    },
    "office_staff_contact_info": {
        "contact_name": null,
        "title": "Director, Managed Care Liaison Services",
        "contact_phone": null,
        "fax": null
    },
    "signature": {
        "molina_signature": null
    },
    "content": {
        "greeting": "Dear [Name],",
        "body": [
            "This Provider Rate letter agreement is to confirm our recent telephone conversation regarding member [member name] whose health benefits are administered by Molina Complete Care of Arizona (MCC). We appreciate your willingness to work with us on this referral.",
            "As part of our authorization procedures, this Provider Rate letter agreement must be executed prior to billing for covered services. Should we not receive an executed Provider Rate letter from you as described, any claims submitted relating to the services contemplated pursuant to this letter may be denied.",
            "As discussed, Molina Complete Care will process the claim for covered and authorized health services provided by you to the above-named member at the negotiated rate of $[rate] for Rev code 192, approved for the following Revenue Code(s), CPT or Services for prior authorization [codes] for dates 11/17/2022 – 11/21/2022. An authorization does not guarantee payment. All care must be authorized in advance by Molina Complete Care and medically necessary. Payment for such services is subject to all terms, conditions, limitations, and exclusions of the Arizona Medicaid AHCCCS Complete Care program and Provider agrees to provide medically necessary covered services pursuant to MCC’s policies and procedures, including those relating to UM/UR.",
            "By accepting this agreement, practitioner agrees that this rate is to be accepted as payment in full and that in no event, including but not limited to, non-payment by MCC who has the ultimate responsibility for payment of covered services to members, insolvency of MCC, or breach of this agreement, shall Provider bill, charge, collect a deposit from, seek compensation, remuneration or reimbursement from, or have any recourse against any members or any other persons other than MCC for services provided pursuant to this agreement. Provider shall defend, hold harmless and indemnify Molina Complete Care and Member against any and all claims, liability, causes of action, damages or judgments, including court costs, expenses and reasonable attorney fees, asserted against, imposed upon or incurred by the Parties that arise out of the acts or omissions of Provider or Provider’s employees, agents or representatives in the discharge of its responsibilities under this Agreement. This provision shall not prohibit collection of any applicable co-payments, deductibles, and co-insurance billed in accordance with member’s benefit plan and shall not prohibit collection of fees resulting from member’s failure to meet the terms of his/her benefit plan.",
            "Provider acknowledges it has all licenses required to provide Covered Services in accordance with this Provider Rate letter. Provider further represents and warrants that: Provider, employees, subcontractors and agents are not debarred, suspended, terminated or otherwise excluded under any state or federal exclusion list and operating in accordance with all applicable State and Federal laws and regulations, including but not limited to those promulgated under the Arizona Medicaid program. Payments for Covered Services rendered to Member enrolled with MCC through a government health program are derived from State and/or federal funds. Such payments may be subject to civil and criminal law governing such government health programs.",
            "Provider agrees that in the event of the insolvency of MCC or other cessation of operations, Provider will continue to provide Covered Services to Enrollees through the period for which Enrollee’s premium has been paid, and to each Enrollee confined in an inpatient facility on the date of insolvency or other cessation of operations, until such Enrollee’s discharge.",
            "Provider agrees to submit itemized claims for processing no later than sixty (60) days from the date covered services are rendered to member or within the time period mandated by applicable state and federal laws and in compliance with Molina Complete Care’s policies and procedures as posted at including, but not limited to, the use of Health Insurance Portability and Accountability Act (HIPAA) compliant code sets."
        ]
    },
    "exhibit": "Molina AZ SCA, Continued",
    "claims_submission": {
        "address": {
            "name": "Molina Complete Care of Arizona",
            "department": "Claims Service Center",
            "street": "2371 Grand Ave",
            "po_box": "PO BOX 93125",
            "city_state_zip": "Long Beach, CA 90809-9914"
        }
    },
    "provider_responsibilities": [
        "Provider understands that only the member's payor can verify member's current eligibility.",
        "In the event that it is retroactively determined that the member was not eligible, Molina Complete Care will have no financial responsibility for services provided.",
        "Provider is responsible for contacting member's plan using contact information on the member's card to verify member eligibility, especially when a request for services has not previously been reviewed by Molina Complete Care's staff.",
        "Provider agrees to maintain the confidentiality of all information regarding services provided to the member, in accordance with any applicable state and federal law, including, but not limited to, HIPAA."
    ],
    "agreement": {
        "description": "This Agreement constitutes the entire agreement between the parties and supersedes any prior agreements between the parties, whether written or oral, relating to the subject matter of this letter. By signing the practitioner is giving permission and consent for Molina Complete Care and/or its designee, to obtain and verify information provided in this form, concerning; to the release by any person, organization, or other entity to Molina Complete Care and/or its designee, of all information relevant to the evaluation of the practitioner's ability to render clinical services in a cost-effective manner and the practitioner's moral and ethical qualifications and agreeing to hold harmless any such person or organization or other entity from any cause of action based on the release of such information to Molina Complete Care and/or its designee. The practitioner understands that continuing participation as a provider for Molina Complete Care is dependent upon successful completion of the credentialing and contracting processes.",
        "contact": {
            "phone": "480-XXX-XXXX",
            "member_issues_phone": "800-424-6524"
        }
    },
    "signatures": {
        "molina_complete_care": {
            "signature": null,
            "printed_name": null,
            "title": "CEO, Plan President",
            "date": "01/31/2023"
        },
        "provider": {
            "signature": null,
            "printed_name": null,
            "title": "Director, Managed Care Liaison Services",
            "date": "12/20/2022"
        }
    },
    "form": "W-9",
    "instructions_url": "http://www.irs.gov/FormW9",
    "part_1": {
        "title": "Taxpayer Identification Number (TIN)",
        "instructions": "Enter your TIN in the appropriate box. The TIN provided must match the name given on line 1 to avoid backup withholding. For individuals, this is generally your social security number (SSN). However, for a resident alien, sole proprietor, or disregarded entity, see the instructions for Part I, later. For other entities, it is your employer identification number (EIN). If you do not have a number, see How to get a TIN, later.",
        "fields": [
            {
                "title": "Social security number",
                "value": null
            },
            {
                "title": "Employer identification number",
                "value": null
            }
        ]
    },
    "part_2": {
        "title": "Certification",
        "instructions": "Under penalties of perjury, I certify that:",
        "certifications": [
            "1. The number shown on this form is my correct taxpayer identification number (or I am waiting for a number to be issued to me); and",
            "2. I am not subject to backup withholding because: (a) I am exempt from backup withholding, or (b) I have not been notified by the Internal Revenue Service (IRS) that I am subject to backup withholding as a result of a failure to report all interest or dividends, or (c) the IRS has notified me that I am no longer subject to backup withholding; and",
            "3. I am a U.S. citizen or other U.S. person (defined below); and",
            "4. The FATCA code(s) entered on this form (if any) indicating that I am exempt from FATCA reporting is correct."
        ],
        "note": "The IRS does not require your consent to any provision of this document other than the certifications required to avoid backup withholding."
    }
}